In [1]:
# data Frame

In [3]:
import pandas as pd
print('done')

done

In [4]:
# 1d_data = series
# 2d_data = Multiple series rows and columns:- DF

In [5]:
print(dir(pd))

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_built_with_meson', '_config', '_is_numpy_dev', '_libs', '_pandas_datetime_CAPI', '_pandas_parser_CAPI', '_testing', '_typing', '_version_meson', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [6]:
# dataframe

In [7]:
# dict

In [12]:
data = {'Names':['Mohan','Sahil','Deepak','Naman'],
       'Salary':[23456,87876,56789,87876],
       'Address':['Noida','Delhi','Gr Noida','Gurgaon']}

In [13]:
pd.DataFrame(data)

    Names  Salary   Address
0   Mohan   23456     Noida
1   Sahil   87876     Delhi
2  Deepak   56789  Gr Noida
3   Naman   87876   Gurgaon

In [23]:
# list of list

data = [[1,2,3,4,5],
       [2,2,2,2,6],
       [3,3,3,3,9]]

pd.DataFrame(data,columns=['Col_'+str(i+1) for i in range(len(data[0]))])

   Col_1  Col_2  Col_3  Col_4  Col_5
0      1      2      3      4      5
1      2      2      2      2      6
2      3      3      3      3      9

In [20]:
len(data)+1

4

In [28]:
# list of list

data = [[1,2,3,4,5],
       [2,2,2,2,6],
       [3,3,3,3,9]]

pd.DataFrame(data,index = range(10,len(data)+10),
             columns=['Col_'+str(i+1) for i in range(len(data[0]))])

    Col_1  Col_2  Col_3  Col_4  Col_5
10      1      2      3      4      5
11      2      2      2      2      6
12      3      3      3      3      9

In [29]:
# tupl of tuple

data = ((1,2,3,4,5),
       (2,2,2,2,6),
       (3,3,3,3,9))

pd.DataFrame(data,index = range(10,len(data)+10),
             columns=['Col_'+str(i+1) for i in range(len(data[0]))])

    Col_1  Col_2  Col_3  Col_4  Col_5
10      1      2      3      4      5
11      2      2      2      2      6
12      3      3      3      3      9

In [30]:
# list of tuple

data = [(1,2,3,4,5),
       (2,2,2,2,6),
       (3,3,3,3,9)]

pd.DataFrame(data,index = range(10,len(data)+10),
             columns=['Col_'+str(i+1) for i in range(len(data[0]))])

    Col_1  Col_2  Col_3  Col_4  Col_5
10      1      2      3      4      5
11      2      2      2      2      6
12      3      3      3      3      9

In [31]:
# tuple of list

data = [(1,2,3,4,5),
       (2,2,2,2,6),
       (3,3,3,3,9)]

pd.DataFrame(data,index = range(10,len(data)+10),
             columns=['Col_'+str(i+1) for i in range(len(data[0]))])

    Col_1  Col_2  Col_3  Col_4  Col_5
10      1      2      3      4      5
11      2      2      2      2      6
12      3      3      3      3      9

In [33]:
# array
import numpy as np

In [34]:
data = np.array([[1,2,3,4,5],
       [2,2,2,2,6],
       [3,3,3,3,9]])

pd.DataFrame(data,index = range(10,len(data)+10),
             columns=['Col_'+str(i+1) for i in range(len(data[0]))])

    Col_1  Col_2  Col_3  Col_4  Col_5
10      1      2      3      4      5
11      2      2      2      2      6
12      3      3      3      3      9

In [38]:
data = np.full((5,5),5)

pd.DataFrame(data,
             columns=['Col_'+str(i+1) for i in range(len(data[0]))])

   Col_1  Col_2  Col_3  Col_4  Col_5
0      5      5      5      5      5
1      5      5      5      5      5
2      5      5      5      5      5
3      5      5      5      5      5
4      5      5      5      5      5

In [40]:
data = np.random.randint(1,100,(3,3,3))

pd.DataFrame(data,index = range(10,len(data)+10),
             columns=['Col_'+str(i+1) for i in range(len(data[0]))])

ValueError: Must pass 2-d input. shape=(3, 3, 3)

In [41]:
# 

data = np.full((5,5),5-7j)

pd.DataFrame(data,
             columns=['Col_'+str(i+1) for i in range(len(data[0]))])

      Col_1     Col_2     Col_3     Col_4     Col_5
0  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j
1  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j
2  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j
3  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j
4  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j  5.0-7.0j

In [42]:
# read_csv

In [43]:
# read_excel

In [44]:
# read_json

In [75]:
data = '''Name,Age,Salary
Aman,12,87654
karan,23,98765'''

In [76]:
[i for i in data.splitlines()]

['Name,Age,Salary', 'Aman,12,87654', 'karan,23,98765']

In [77]:
table = [i.split(',') for i in data.splitlines()]
# pd.DataFrame(table)

In [78]:
table

[['Name', 'Age', 'Salary'], ['Aman', '12', '87654'], ['karan', '23', '98765']]

In [79]:
pd.DataFrame(table[1:],columns= table[0])

    Name Age Salary
0   Aman  12  87654
1  karan  23  98765

In [82]:
table = pd.read_csv(r"C:\Users\Lenovo\Desktop\students.csv")
table

   student_id  student_name  roll_no  class   address    phone_no
0           1   karan Verma      101      5     Noida  9876543298
1           2  Akshay Verma      102      6  Gr Noida  9888543298
2           3   Nitin Verma      103      7     Noida  9876598298
3           4  Ambani Sahab      104      8     Delhi   986543298
4           5  Gaurav Kumar      105      9     Noida  8876543298

In [84]:
table = pd.read_csv("C:\\Users\\Lenovo\\Desktop\\students.csv")
table

   student_id  student_name  roll_no  class   address    phone_no
0           1   karan Verma      101      5     Noida  9876543298
1           2  Akshay Verma      102      6  Gr Noida  9888543298
2           3   Nitin Verma      103      7     Noida  9876598298
3           4  Ambani Sahab      104      8     Delhi   986543298
4           5  Gaurav Kumar      105      9     Noida  8876543298

In [85]:
table = pd.read_csv("C:/Users/Lenovo/Desktop/students.csv")
table

   student_id  student_name  roll_no  class   address    phone_no
0           1   karan Verma      101      5     Noida  9876543298
1           2  Akshay Verma      102      6  Gr Noida  9888543298
2           3   Nitin Verma      103      7     Noida  9876598298
3           4  Ambani Sahab      104      8     Delhi   986543298
4           5  Gaurav Kumar      105      9     Noida  8876543298

In [88]:
path = '''https://github.com/ankitmisk/Python_DA_New_Batch_10_11/blob/main/test_file/employee.csv?raw=true'''
table = pd.read_csv(path)

In [89]:
table

   Eid    name  Salary   dept
0    1   Karan      23     it
1    2   Mohan     454     hr
2    3    Ravi       3     hr
3    4  Akshay     454     it
4    5   Jatin    6435  sales

In [90]:
# read_excel

In [91]:
pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx")

    Region  Sales   Qty  profit
0     West   3828  3853    4333
1     East   1912  1305    4739
2     West   4046  2176    2650
3    South   2995  3309    1098
4     East   2872  4592    3532
5    South   4896  2896    1242
6  central   4904  3153    2671

In [3]:
import pandas as pd
all_sheets = pd.ExcelFile(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx").sheet_names

In [4]:
pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[2])

    Region  Sales   Qty  profit
0   Python   3828  3853    4333
1     East   1912  1305    4739
2     West   4046  2176    2650
3    South   2995  3309    1098
4     East   2872  4592    3532
5    South   4896  2896    1242
6  central   4904  3153    2671

In [5]:
table_1 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[0])
table_2 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[1])
table_3 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[2])

In [6]:
table_1

    Region  Sales   Qty  profit
0     West   3828  3853    4333
1     East   1912  1305    4739
2     West   4046  2176    2650
3    South   2995  3309    1098
4     East   2872  4592    3532
5    South   4896  2896    1242
6  central   4904  3153    2671

In [7]:
table_2

      Region  Sales   Qty  profit
0  Techvidya   3828  3853    4333
1       East   1912  1305    4739
2       West   4046  2176    2650
3      South   2995  3309    1098
4       East   2872  4592    3532
5      South   4896  2896    1242
6    central   4904  3153    2671

In [8]:
table_3

    Region  Sales   Qty  profit
0   Python   3828  3853    4333
1     East   1912  1305    4739
2     West   4046  2176    2650
3    South   2995  3309    1098
4     East   2872  4592    3532
5    South   4896  2896    1242
6  central   4904  3153    2671

In [9]:
all_sheets

['Sheet1', 'Sheet2', 'Sheet3']

In [107]:
all_table = []

for i in all_sheets:
    all_table.append(pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = i))

In [112]:
table_34

NameError: name 'table_34' is not defined

In [113]:
# for i in range():

In [114]:
# exec()

In [120]:
for i in range(1000000):
    exec(f'a_{i} = 100')

In [121]:
a_1

100

In [122]:
a_5

100

In [123]:
a_10

100

In [124]:
a_9999

100

In [11]:
for i in all_sheets:
    print(i)

Sheet1
Sheet2
Sheet3

In [29]:
all_sheets = pd.ExcelFile(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx").sheet_names
all_sheets

['Sheet1', 'Sheet2', 'Sheet3', 'Sheet4']

In [30]:
for i,value in enumerate(all_sheets):
    exec(f'''table_{i+1} = pd.read_excel(r"C:\\Users\\Lenovo\\Desktop\\mera_sales.xlsx",sheet_name = value)''')

In [31]:
# pd.read_excel("C:\\Users\\Lenovo\\Desktop\\mera_sales.xlsx")

In [32]:
table_3

    Region  Sales   Qty  profit
0   Python   3828  3853    4333
1     East   1912  1305    4739
2     West   4046  2176    2650
3    South   2995  3309    1098
4     East   2872  4592    3532
5    South   4896  2896    1242
6  central   4904  3153    2671

In [33]:
table_1

    Region  Sales   Qty  profit
0     West   3828  3853    4333
1     East   1912  1305    4739
2     West   4046  2176    2650
3    South   2995  3309    1098
4     East   2872  4592    3532
5    South   4896  2896    1242
6  central   4904  3153    2671

In [34]:
table_2

      Region  Sales   Qty  profit
0  Techvidya   3828  3853    4333
1       East   1912  1305    4739
2       West   4046  2176    2650
3      South   2995  3309    1098
4       East   2872  4592    3532
5      South   4896  2896    1242
6    central   4904  3153    2671

In [35]:
table_4

   Region  Sales   Qty  profit
0  Python   3828  3853    4333
1  Python   1912  1305    4739
2  Python   4046  2176    2650
3  Python   2995  3309    1098
4  Python   2872  4592    3532
5  Python   4896  2896    1242
6  Python   4904  3153    2671

In [36]:
a = 23

In [1]:
print(a)

NameError: name 'a' is not defined

In [10]:
all_code = []

for i in range(1,101):
    code = f'''table_{i} = pd.read_excel(r"C:\\Users\\Lenovo\\Desktop\\mera_sales.xlsx",sheet_name = all_sheets[{i}])'''
    all_code.append(code)

In [11]:
for i in  all_code:
    print(i)

table_1 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[1])
table_2 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[2])
table_3 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[3])
table_4 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[4])
table_5 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[5])
table_6 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[6])
table_7 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[7])
table_8 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[8])
table_9 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[9])
table_10 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[10])
table_11 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[11])
table_12 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[12])
table_13 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[13])
table_14 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[14])
table_15 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[15])
table_16 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[16])
table_17 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[17])
table_18 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[18])
table_19 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[19])
table_20 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[20])
table_21 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[21])
table_22 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[22])
table_23 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[23])
table_24 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[24])
table_25 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[25])
table_26 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[26])
table_27 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[27])
table_28 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[28])
table_29 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[29])
table_30 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[30])
table_31 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[31])
table_32 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[32])
table_33 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[33])
table_34 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[34])
table_35 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[35])
table_36 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[36])
table_37 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[37])
table_38 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[38])
table_39 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[39])
table_40 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[40])
table_41 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[41])
table_42 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[42])
table_43 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[43])
table_44 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[44])
table_45 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[45])
table_46 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[46])
table_47 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[47])
table_48 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[48])
table_49 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[49])
table_50 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[50])
table_51 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[51])
table_52 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[52])
table_53 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[53])
table_54 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[54])
table_55 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[55])
table_56 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[56])
table_57 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[57])
table_58 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[58])
table_59 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[59])
table_60 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[60])
table_61 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[61])
table_62 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[62])
table_63 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[63])
table_64 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[64])
table_65 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[65])
table_66 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[66])
table_67 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[67])
table_68 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[68])
table_69 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[69])
table_70 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[70])
table_71 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[71])
table_72 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[72])
table_73 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[73])
table_74 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[74])
table_75 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[75])
table_76 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[76])
table_77 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[77])
table_78 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[78])
table_79 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[79])
table_80 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[80])
table_81 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[81])
table_82 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[82])
table_83 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[83])
table_84 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[84])
table_85 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[85])
table_86 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[86])
table_87 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[87])
table_88 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[88])
table_89 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[89])
table_90 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[90])
table_91 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[91])
table_92 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[92])
table_93 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[93])
table_94 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[94])
table_95 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[95])
table_96 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[96])
table_97 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[97])
table_98 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[98])
table_99 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[99])
table_100 = pd.read_excel(r"C:\Users\Lenovo\Desktop\mera_sales.xlsx",sheet_name = all_sheets[100])